In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
titanic = sns.load_dataset('titanic')

In [3]:
df = titanic.loc[:, ['age', 'fare']]

In [4]:
print(df.head(10))

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
7   2.0  21.0750
8  27.0  11.1333
9  14.0  30.0708

In [5]:
def missing_value(series) :
    return series.isnull()

In [6]:
result = df.apply(missing_value, axis = 0)

In [7]:
result.head(10)

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5   True  False
6  False  False
7  False  False
8  False  False
9  False  False

In [8]:
print(type(result))

<class 'pandas.core.frame.DataFrame'>

In [9]:
def min_max(x) :
    return x.max()-x.min()

In [10]:
result = df.apply(min_max)
print(result)
print(type(result))

age      79.5800
fare    512.3292
dtype: float64
<class 'pandas.core.series.Series'>

In [16]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
df['ten'] = 10
print(df.head(10))

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10
5   NaN   8.4583   10
6  54.0  51.8625   10
7   2.0  21.0750   10
8  27.0  11.1333   10
9  14.0  30.0708   10

In [17]:
def add_two_obj(a, b):
    return a + b

In [19]:
df['add'] = df.apply(lambda x : add_two_obj(x['age'], x['ten']), axis = 1)
print(df.head())

    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

In [20]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]

In [21]:
def missing_value(x):
    return x.isnull()

In [22]:
def missing_count(x):
    return missing_value(x).sum()

In [23]:
def total_number_missing(x):
    return missing_count(x).sum()

In [24]:
result_df = df.pipe(missing_value)
print(result_df.head())
print(type(result_df))

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
<class 'pandas.core.frame.DataFrame'>

In [27]:
result_df1 = df.pipe(missing_count)
print(result_df1)
print(type(result_df1))

age     177
fare      0
dtype: int64
<class 'pandas.core.series.Series'>

In [28]:
result_df3 = df.pipe(total_number_missing)
print(result_df3)
print(type(result_df3))

177
<class 'numpy.int64'>

In [29]:
df = titanic.loc[0:4, 'survived': 'age']

In [30]:
df

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [31]:
columns = list(df.columns.values)

In [32]:
print(columns)

['survived', 'pclass', 'sex', 'age']

In [34]:
# 라이브러리 불러오기
import seaborn as sns

# titanic dataset choose & make data frame
titanic = sns.load_dataset('titanic')
df = titanic.loc[0:4, 'survived':'age']
print(df, '\n')

# make columns name list
columns = list(df.columns.values) # columns name
print(columns, '\n')

# sort by alphabet
columns_sorted = sorted(columns) # sort by alphabet
df_sorted = df[columns_sorted]
print(df_sorted, '\n')

# sort by reverse alphabet
columns_reversed = list(reversed(columns))
df_reversed = df[columns_reversed]
print(df_reversed, '\n')

# sort by user
columns_customed = ['pclass', 'age', 'sex', 'survived']
df_customed = df[columns_customed]
print(df_customed, '\n')

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

['survived', 'pclass', 'sex', 'age']

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

   pclass   age     sex  survived
0       3  22.0    male         0
1       1  38.0  female         1
2       3  26.0  female         1
3       1  35.0  female         1
4       3  35.0    male         0

In [35]:
import pandas as pd

In [37]:
df = pd.read_excel('주가데이터.xlsx')

In [42]:
df.head(10)

         연월일   당일종가  전일종가     시가     고가     저가     거래량
0 2018-07-02  10100   600  10850  10900  10000  137977
1 2018-06-29  10700   300  10550  10900   9990  170253
2 2018-06-28  10400   500  10900  10950  10150  155769
3 2018-06-27  10900   100  10800  11050  10500  133548
4 2018-06-26  10800   350  10900  11000  10700   63039
5 2018-06-25  11150   150  11400  11450  11000   55519
6 2018-06-22  11300   100  11250  11450  10750  134805
7 2018-06-21  11200   350  11350  11750  11200  133002
8 2018-06-20  11550   250  11200  11600  10900  308596
9 2018-06-19  11300   700  11850  11950  11300  180656

In [39]:
type(df)

pandas.core.frame.DataFrame

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   연월일     20 non-null     datetime64[ns]
 1   당일종가    20 non-null     int64
 2   전일종가    20 non-null     int64
 3   시가      20 non-null     int64
 4   고가      20 non-null     int64
 5   저가      20 non-null     int64
 6   거래량     20 non-null     int64
dtypes: datetime64[ns](1), int64(6)
memory usage: 1.2 KB

In [43]:
df.dtypes

연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
dtype: object

In [44]:
df['연월일'] = df['연월일'].astype('str')
dates = df['연월일'].str.split('-')
print(dates.head())

0    [2018, 07, 02]
1    [2018, 06, 29]
2    [2018, 06, 28]
3    [2018, 06, 27]
4    [2018, 06, 26]
Name: 연월일, dtype: object

In [45]:
df['연'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)

In [46]:
df.head()

          연월일   당일종가  전일종가     시가     고가     저가     거래량     연   월   일
0  2018-07-02  10100   600  10850  10900  10000  137977  2018  07  02
1  2018-06-29  10700   300  10550  10900   9990  170253  2018  06  29
2  2018-06-28  10400   500  10900  10950  10150  155769  2018  06  28
3  2018-06-27  10900   100  10800  11050  10500  133548  2018  06  27
4  2018-06-26  10800   350  10900  11000  10700   63039  2018  06  26